WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/ethernet/meadow_ethnet_monitor.c
/****************************************************************************
 * /configs/stm32f777zit6-meadow/src/ethernet/meadow_ethnet_monitor.c
 * 
 *   Copyright (C) 2021-2023 Wilderness Labs. All rights reserved.
 *   Author:  Wilderness Labs
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

// This module contains code to monitor the state of the Ethernet.
// It is very LAN9355 specific and if another lan chip is supported this module
// might well be renamed and a new module created just for the new lan chip

// Parts of this module orginally were taken from nuttx 7.x at
// /apps/nshlib/nsh_netinit.c. Plus a single line change from Nuttx 10 was
// made.

#warning "(--) Peter is here"

/****************************************************************************
 * Included Files
 ****************************************************************************/
#include <nuttx/config.h>
#include <ctype.h>
#include <stdint.h>
#include <nuttx/kthread.h>
#include <nuttx/clock.h>
#include <nuttx/net/mii.h>
#include <nuttx/syslog/syslog.h>
#include <nuttx/wqueue.h>
#include <nuttx/kmalloc.h>

#include "stm32_ethernet.h"
#include "meadow_ethnet_local.h"
#include <meadow/meadow_ethnet_common.h>
#include "../hcom_nx/hcom_nx_config_manager.h"
#include "../ntpclient/ntpclient.h"
#include "../espcp/espcp_common.h"

#ifndef CONFIG_SCHED_HPWORK
#error "meadow_ethnet_monitor requires CONFIG_SCHED_HPWORK"
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

// Nuttx signals are defined in /nuttx/include/signal.h
// #define MEADOW_ETH_MONITOR_SIGNAL_NO        (18)

// (--) RETHINK THIS ENTIRE TIMING THING. IS IT NEEDED AT ALL???
// The first 2 defines are arbitrary and the third was the a Nuttx config
// option CONFIG_NSH_NETINIT_RETRYMSEC
#define MEADOW_ETH_MONITOR_LONG_RECHECK_SEC     (2) // FOR TESTING ALL VALUES ARE SET TO 2 SECONDS
// #define MEADOW_ETH_MONITOR_LONG_RECHECK_SEC     (60) // One minute
// #define MEADOW_ETH_MONITOR_LONG_RECHECK_SEC     (60*60) // One hour in seconds
#define MEADOW_ETH_MONITOR_SHORT_RECHECK_SEC    (2)     // 2 seconds
#define MEADOW_ETH_MONITOR_RETRY_RECHECK_SEC    (2)     // 2 seconds

// Nuttx config provides CONFIG_STM32F7_PHYADDR for a single PHY but I have
// chosen to ignore this Nuttx config value because we need more options.
#define MEADOW_ETH_MONITOR_PHY_0  (0)
#define MEADOW_ETH_MONITOR_PHY_1  (1)
#define MEADOW_ETH_MONITOR_PHY_2  (2)

// Is Ethernet included?
#if defined(CONFIG_MEADOW_ETHNET_INCLUDE_IN_BUILD)

// (--) FIX NAME TO REFLECT H/W SUPOPORTED?
// PH14 is wired to LAN9355's ETH_IRQ LINE. The LAN9355's ETH_IRQ_LINE is
// configured for push-pull operation
#define MEADOW_ETH_PHY_IRQ_INPUT_PH14 (GPIO_INPUT | GPIO_FLOAT | GPIO_PORTH | GPIO_PIN14)

// (--) IS THIS NEEDED OR IS THIS ENTIRE FILE DEDICATED TO LAN9355?
#define MEADOW_ETHERNET_BUILD_FOR_USE_LAN9355         1
// The LAN9355 is the only ethernet switch currently be used with any Meadow
// that has  ethernet connectivity.
// In the future this may need a configuration option or query the chip to
// determine the proper chip at run-time. There is code in this module that
// detects the chip type and will not run if it is not a LAN9355.
// At this time Nuttx has no specific support for the LAN9355, therefore it 
// was found that LAN8742A configuration would also support the LAN9355. for
// basic operation.

// R/O register that indicate the interrupt source of the PHY interrupts.
// A read will clear the bits in this register (9.2.20.20)
// Needed in ISR to deterine if the interrupt was link up, link down or
// neither.
#define LAN9355_PHY_INTERRUPT_SOURCE (29)   // 16-bit register

// R/W register used to enable or mask the PHY interrupts (9.2.20.21 -
// PHY_INTERRUPT_MASK_x)
// Needed to enable link up (bit 9) & link down (bit 4) interrupts.
// Used in conjunction with 'INT_EN' to enable PHY A & B
#define LAN9355_PHY_INTERRUPT_MASK (30)     // 16-bit register

// Needed to verify that the connected lan chip is the supported LAN9355
#define LAN9355_CHIP_ID_REVISION_REGISTER (0x50)  // 32-bit register

// IRQ configuration register (8.3.1 - IRQ_CFG)
// Needed to enable and set the IRQ line's behavior
#define LAN9355_PHY_INTERRUPT_IRQ_CFG (0x54)      // 32-bit register
// IRQ status register (8.3.2 - INT_STS)
// Needed to determine the source PHY A (bit 26) or B (bit 27)
#define LAN9355_PHY_INTERRUPT_INT_STS (0x58)      // 32-bit register
// IRQ enable/mask register (8.3.3 - INT_EN)
// Needed to enable interrupts for PHY A (bit 26) & B (bit 27)
#define LAN9355_PHY_INTERRUPT_INT_EN  (0x5c)      // 32-bit register

// For timeout of certain read/write operation that need to be delayed
#define LAN9355_PHY_READ_TIMEOUT  (0x0004ffff)
#define LAN9355_PHY_WRITE_TIMEOUT (0x0004ffff)

// Allocating memory for the worker thread to use is problematic because if
// another function in this module calls a queued worker invocation the
// pointer to the allocated memory will be lost when the OS reschedules the
// new invocation.
// Therefore, a single 32-bit value contains the current status (only
// available from the ISR) and the previous status (not know by startup).
// The following allow this information to be determined by the ISR. The LS
// bits store the status info.
#define WORKER_HAVE_CURRENT_LINK_STATUS (0xf0000000)
#define WORKER_STATUS_PHY_1_CURR_MASK   (0x00000001)
#define WORKER_STATUS_PHY_1_CURR_SHIFT  (0)
#define WORKER_STATUS_PHY_2_CURR_MASK   (0x00000002)
#define WORKER_STATUS_PHY_2_CURR_SHIFT  (1)
// #define WORKER_STATUS_PHY_1_PREV_MASK   (0x00000004)
// #define WORKER_STATUS_PHY_1_PREV_SHIFT  (2)
// #define WORKER_STATUS_PHY_2_PREV_MASK   (0x00000008)
// #define WORKER_STATUS_PHY_2_PREV_SHIFT  (3)

/****************************************************************************
 * Private Data
 ****************************************************************************/
static char *thisFile = __FILE__;
static bool _prevStatusPhy1;    // Last know status for Ethernet link #1
static bool _prevStatusPhy2;    // Last know status for Ethernet link #2

