WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/ethernet/meadow_ethnet_monitor.c
// Each work_s struct can support one queued worker. If, while one worker is
// waiting to be run another call to work_queue is made with the same work_s
// the first invocation is over-written by the second.
static struct work_s _eth_mon_work_q_struct;

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/
// static void *meadow_eth_monitor_kthread(int argc, char *argv[]);
// static int meadow_eth_mon_check_phy_link_status(void);
static int meadow_eth_monitor_link_status_isr(int irq, void *context, void *arg);
static void meadow_eth_monitor_worker(void *arg);
static int meadow_eth_config_lan9355_irq(void);
static int meadow_eth_mon_report_link_status_change(bool isLinkUp);

static int meadow_eth_phywrite_16(uint16_t phyAddr, uint16_t regAddr, uint16_t value);
static int meadow_eth_phyread_16(uint16_t phyAddr, uint16_t regAddr, uint16_t *value);
static int meadow_eth_phywrite_32(uint16_t csrAddr, uint32_t value);
static int meadow_eth_phyread_32(uint16_t csrAddr, uint32_t *value);

/****************************************************************************
 * Function Implementations
 ****************************************************************************/
// Called at startup after attempting to make ethernet connection
int meadow_eth_monitor_startup(void)
{
  int ret;
  uint32_t lanChipId;

  _prevStatusPhy1 = false;
  _prevStatusPhy2 = false;

  // Verify this is a LAN9355 chip
  ret = meadow_eth_phyread_32(LAN9355_CHIP_ID_REVISION_REGISTER,
            &lanChipId);
  if (ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-meadow_eth_phyread_32 failed, ret:%d, errno:%d\n",
                thisFile, __LINE__, ret, errno);
    return ret;
  }

  // (--) TEMPORARY
  syslog(1, "mon - Chip Id:0x%08x\n", lanChipId);
  // (--) TEMPORARY

  if((lanChipId & 0xffff0000) != 0x93550000)
  {
    syslog(LOG_ERR, "%s@%d-Ethernet chip must be LAN9355\n",
                thisFile, __LINE__);
    return -ENOTSUP;
  }

  // Configure the LAN9355 to generate an interrupts when there's a
  // change in either PHY link status.
  ret = meadow_eth_config_lan9355_irq();
  if (ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-meadow_eth_config_lan9355_irq failed, ret:%d, errno:%d\n",
                thisFile, __LINE__, ret, errno);
    return ret;
  }

  // There's no need to call the worker thread here because the caller of this
  // function has already checked the startup status and set _prevStatusPhy1 and
  // _prevStatusPhy2 values apropriately.
  // Now that the LAN9355 interrupts are configured everything should be automatic.
  return OK;
}

//=============================================================
// This ISR is called by LAN9355 for changes in PHY status.
int meadow_eth_monitor_link_status_isr(int irq, void *context, void *arg)
{
  uint16_t temp16;
  bool currStatusPhy1;
  bool currStatusPhy2;
 
  syslog(1, "--------------------------------------------------\n");
  syslog(1, "mon-isr-Eth monitor's ISR received interrupt\n");

  // Nuttx has already acknowledged the GPIO interrupt that generated this
  // call. But, the LAN9355 requiries 2 register reads for each PHY.
  // In this register PHY A bit 9 link up, bit 4 link down.
  (void) meadow_eth_phyread_16(1, LAN9355_PHY_INTERRUPT_SOURCE, &temp16);
  (void) meadow_eth_phyread_16(2, LAN9355_PHY_INTERRUPT_SOURCE, &temp16);

  // Now clear the link status registers
  (void) meadow_eth_phyread_16(1, MII_MSR, &temp16);
  currStatusPhy1 = (temp16 & MII_MSR_LINKSTATUS) != 0;

  (void) meadow_eth_phyread_16(2, MII_MSR, &temp16);
  currStatusPhy2 = (temp16 & MII_MSR_LINKSTATUS) != 0;

  // Combine status values just read into a value for worker thread to use.
  // Allocating a struct has risks because if another work item is
  // queued using the same 'struct work_s', the memory would be leaked.
  uint32_t phyStatus = WORKER_HAVE_CURRENT_LINK_STATUS;
  if(currStatusPhy1) phyStatus |= WORKER_STATUS_PHY_1_CURR_MASK;
  if(currStatusPhy2) phyStatus |= WORKER_STATUS_PHY_2_CURR_MASK;

  // TESTING
  syslog(1, "mon-isr-Link    status PREV PHY A:%s, CURR PHY A:%s, PREV PHY B:%s, CURR PHY B:%s\n",
          _prevStatusPhy1 == 0 ? "Down" : "Up",
          currStatusPhy1  == 0 ? "Down" : "Up",
          _prevStatusPhy2 == 0 ? "Down" : "Up",
          currStatusPhy2  == 0 ? "Down" : "Up");
  // TESTING

  // Don't waste time if nothing to do
  if((_prevStatusPhy1 == currStatusPhy1) && (_prevStatusPhy2 == currStatusPhy2))
  {
    syslog(1, "mon-isr-No status change. Early Exit (no work queue needed)\n");
    return OK;
  }

  // Queue the worker and report the current status
  work_queue(HPWORK, &_eth_mon_work_q_struct, meadow_eth_monitor_worker,
            (void *)phyStatus, 0);

  return OK;
}

//=============================================================
// This function is called via the work queue, and only from the ISR.
// It assumes that the global values '_prevStatusPhy1' and '_prevStatusPhy2'
// are correctly set.
// Note: On startup there is other functionality that set the initial status
// values (_prevStatusPhy1 and _prevStatusPhy2).
void meadow_eth_monitor_worker(void *arg)
{
  int ret;
  bool currStatusPhy1;
  bool currStatusPhy2;
  bool linkNowUp = false;
  bool linkWasUp = false;
  uint32_t providedStatus;

  syslog(1, "***Eth monitor worker entry\n");

  if(arg == NULL)
  {
    syslog(LOG_ERR, "meadow_eth_monitor_worker() called with NULL\n");
    return;
  }

  providedStatus = (uint32_t)arg;
  DEBUGASSERT((providedStatus & WORKER_HAVE_CURRENT_LINK_STATUS) != 0);

  // Get the current link status if not provided by caller
  currStatusPhy1 = (providedStatus & WORKER_STATUS_PHY_1_CURR_MASK) != 0;
  currStatusPhy2 = (providedStatus & WORKER_STATUS_PHY_2_CURR_MASK) != 0;

  // Note: We combine the 2 PHY Link Status values into 1 combined link status.
  // This is because, Nuttx and Meadow only support 1 link status.
  if(currStatusPhy1 || currStatusPhy2)
    linkNowUp = true;

  // Were either link up before?
  if(_prevStatusPhy1 || _prevStatusPhy2)
    linkWasUp = true;

  // Keep the individual status values for the next invocation.
  _prevStatusPhy1 = currStatusPhy1;
  _prevStatusPhy2 = currStatusPhy2;

