WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/ethernet/meadow_ethnet_monitor.c
  // Did the combined link status change?
  if(linkNowUp == linkWasUp)
  {
    syslog(1, "Combined link status did not change\n");
    return; // No
  }

  // Report new link status to Nuttx and Meadow
  ret = meadow_eth_mon_report_link_status_change(linkNowUp);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-meadow_eth_mon_report_link_status_change, ret:%d, errno:%d\n",
                thisFile, __LINE__, ret, errno);
    return;
  }

  if(linkNowUp)
  {
    syslog(1, "***Eth monitor worker-combined link up processing\n");

    // Link status has transitioned from down to up
    ret = meadow_eth_start_re_establish_connection();
    if(ret < 0)
    {
      syslog(LOG_ERR, "%s@%d-Re-creating connection failed, ret:%d, errno:%d\n",
                  thisFile, __LINE__, ret, errno);

      return;
    }

    // Determine if we should get the time
    hcom_nx_config_lock();
    meadow_configuration_t *config = hcom_nx_config_get_pointer();
    uint32_t refreshPeriod = config->ntp_refresh_period_seconds;
    bool timeAtStart = config->get_network_time_at_startup;
    hcom_nx_config_unlock();

    // Get the time if appropriate
    if(refreshPeriod > 0 || timeAtStart)
      ntpc_start();
  }
  else
  {
    syslog(1, "***Eth monitor worker-combined link down processing\n");
    // We need to cancel the lease renewal
    ret = meadow_eth_dhcp_cancel_lease_renewal();
    if(ret < 0)
    {
      syslog(LOG_ERR, "%s@%d-Cancelling lease renewal failed, ret:%d, errno:%d\n",
                  thisFile, __LINE__, ret, errno);
    }

    // Stop the reoccurring NTP time request
    ntpc_stop();
  }

  syslog(1, "***Eth monitor worker EOF EXIT\n");
}

//====================================================================
// Report to Nuttx and meadow the change in link status
int meadow_eth_mon_report_link_status_change(bool isLinkUp)
{
  int ret;
  int sockDescp;
  struct ifreq ifr;

  memset(&ifr, 0, sizeof(struct ifreq));
  strncpy(ifr.ifr_name, MEADOW_ETHMAC_DEVICENAME, IFNAMSIZ);

  if(isLinkUp)
  {
    espcp_queue_ethernet_connection_changed_event(true);
    ifr.ifr_flags = IFF_UP;
  }
  else
  {
    espcp_queue_ethernet_connection_changed_event(false);
    ifr.ifr_flags = IFF_DOWN;
  }

  // Get a socket descriptor that we can use to communicate with the network
  // interface driver.
  sockDescp = socket(AF_INET, SOCK_DGRAM, 0);
  if (sockDescp < 0)
  {
    syslog(LOG_ERR, "%s@%d-socket open failed, sockDescp:%d, errno:%d\n",
                thisFile, __LINE__, sockDescp, errno);
    return -errno;
  }

  // Set the Nuttx link status value
  ret = ioctl(sockDescp, SIOCSIFFLAGS, (unsigned long)&ifr);
  if (ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-ioctl(SIOCSIFFLAGS) failed, ret:%d, errno:%d\n",
                thisFile, __LINE__, ret, errno);
    return ret;
  }

  if(sockDescp > -1)
    close(sockDescp);

  return OK;
}

//=============================================================
// This function will configure the LAN9355 to generate an interrutp and route
// it to the IRQ pin of the chip.
int meadow_eth_config_lan9355_irq()
{
  int ret;
  uint32_t meadow_eth_interrupt_status_reg = 0;
  uint16_t regVal16 = 0;

  // This is the full set of our items
  // Bit 0 - IRQ buffer type 1 = push-pull, 0 = open drain
  // Bit 4 - set the polarity can't be used with open drain
  // Bit 8 - IRQ Enable 1 = enable
  meadow_eth_interrupt_status_reg = 0x00000111;

  ret = meadow_eth_phywrite_32(LAN9355_PHY_INTERRUPT_IRQ_CFG, meadow_eth_interrupt_status_reg);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Writing IRQ_CFG failed, ret:%d, errno:%d\n",
                thisFile, __LINE__, ret, errno);
    return ret;
  }

  // Configure the interrupts sources. We want to monitor PHY A and PHY B.
  // This is what enables the specified interrupt to output on the IRQ pin of
  // the LAN9355 chip.
  meadow_eth_interrupt_status_reg = 0x0c000000;  // Bits 26 (PHY A) and 27 (PHY B) need to be set

  ret = meadow_eth_phywrite_32(LAN9355_PHY_INTERRUPT_INT_EN, meadow_eth_interrupt_status_reg);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Writing INT_EN failed, ret:%d, errno:%d\n",
                thisFile, __LINE__, ret, errno);
    return ret;
  }

  // Need to configure the 16-bit LAN9355_PHY_INTERRUPT_MASK (30) to allow
  // link up and link down occurrences to trigger the interrupt for both PHYs.
  // Note: If only link up or link down enabled then no IRQ interrupt is
  // generated when the other happens (e.g. if only link up is enabled then no
  // IRQ interrupt is generated when the link goes down).
  regVal16 = 0x0210;    // Bit 9 (link up) and Bit 4 (link down).

  // This must be done for both PHYs
  ret = meadow_eth_phywrite_16(1, LAN9355_PHY_INTERRUPT_MASK, regVal16);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Writing INT_EN failed, ret:%d, errno:%d\n",
                thisFile, __LINE__, ret, errno);
    return ret;
  }
  
  ret = meadow_eth_phywrite_16(2, LAN9355_PHY_INTERRUPT_MASK, regVal16);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Writing INT_EN failed, ret:%d, errno:%d\n",
                thisFile, __LINE__, ret, errno);
    return ret;
  }

  // Clear any pending interrupts
  (void) meadow_eth_phyread_16(1, LAN9355_PHY_INTERRUPT_SOURCE, &regVal16);
  (void) meadow_eth_phyread_16(2, LAN9355_PHY_INTERRUPT_SOURCE, &regVal16);

  // Reading will clear any unexpected interrupts sources and initialize the
  // previous state information
  (void) meadow_eth_phyread_16(1, MII_MSR, &regVal16);
  _prevStatusPhy1 = (regVal16 & MII_MSR_LINKSTATUS) != 0;
  (void) meadow_eth_phyread_16(2, MII_MSR, &regVal16);
  _prevStatusPhy2 = (regVal16 & MII_MSR_LINKSTATUS) != 0;

  // Configure the GPIO connected to the LAN9355
  stm32_configgpio(MEADOW_ETH_PHY_IRQ_INPUT_PH14);

  // This call makes irq_attach() and up_enable_irq() calls internally.
  // In our case rising edge means link status up and falling edge link
  // status down
  ret = stm32_gpiosetevent(
  MEADOW_ETH_PHY_IRQ_INPUT_PH14,      // Nuttx cfgset
  1,                                  // Rising Edge,
  0,                                  // Falling Edge,
  0,                                  // Event
  meadow_eth_monitor_link_status_isr, // ISR
  NULL);

  return ret;
}

