WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/ethernet/meadow_ethnet_monitor.c
//=============================================================
// This function is called during startup to set the initial link status values
bool meadow_eth_mon_startup_set_status()
{
  uint16_t temp16;

  // These registers contains a single bit field, for PHY status, 1 = Link up
  // and 0 = Link down
  (void) meadow_eth_phyread_16(1, MII_MSR, &temp16);
  _prevStatusPhy1 = (temp16 & MII_MSR_LINKSTATUS) != 0;

  (void) meadow_eth_phyread_16(2, MII_MSR, &temp16);
  _prevStatusPhy2 = (temp16 & MII_MSR_LINKSTATUS) != 0;

  return(_prevStatusPhy1 || _prevStatusPhy2);
}

//=============================================================
// It took me a bit to understand from the LAN9355 data sheet how to configure
// its 32-bit registers. Once understood I created the following to hide the
// complexity. Since the MII protocol only deals with 16-bit values. When
// accessing the 32-bit registers of the LAN9355 two 2 16-bit reads or writes
// are necessary. So, a 32-bit versions of read and write are also provided.
//
// Note: The following don't use Nuttx ioctl (SIOCGMIIREG and SIOCSMIIREG)
// because this requires a socket descriptor (sd). Why? So they can be used
// in the ISR, which uses a different thread.
int meadow_eth_phyread_16(uint16_t phyAddr, uint16_t regAddr, uint16_t *value)
{
  int regval;
  volatile uint32_t timeout;

  // Preserve CSR Clock Range CR[2:0] bits
  regval  = getreg32(STM32_ETH_MACMIIAR);
  regval &= ETH_MACMIIAR_CR_MASK;

  // Set the PHY device address, PHY register address, and set the busy bit.
  regval |= (((uint32_t)phyAddr << ETH_MACMIIAR_PA_SHIFT) & ETH_MACMIIAR_PA_MASK);
  regval |= (((uint32_t)regAddr << ETH_MACMIIAR_MR_SHIFT) & ETH_MACMIIAR_MR_MASK);
  regval |= ETH_MACMIIAR_MB;

  putreg32(regval, STM32_ETH_MACMIIAR);

  // Wait for the transfer to complete
  for (timeout = 0; timeout < LAN9355_PHY_READ_TIMEOUT; timeout++)
  {
    // When the ETH_MACMIIAR_MW is clear, the read has completed.
    if ((getreg32(STM32_ETH_MACMIIAR) & ETH_MACMIIAR_MB) == 0)
    {
      // Read the register value from data register
      *value = (uint16_t)(getreg32(STM32_ETH_MACMIIDR) & 0xffff);
      return OK;
    }
  }

  syslog(1, "mon-MII transfer timed out: phyAddr: %04x regAddr: %04x\n",
        phyAddr, regAddr);

  return -ETIMEDOUT;
}

//=============================================================
// This is a simple wrapper to hide the complexity of writing to a 16-bit register
int meadow_eth_phywrite_16(uint16_t phyAddr, uint16_t regAddr, uint16_t value)
{
  volatile uint32_t timeout;
  uint32_t regval;

  // Preserve CSR Clock Range CR[2:0] bits
  regval = getreg32(STM32_ETH_MACMIIAR);
  regval &= ETH_MACMIIAR_CR_MASK;

  // To conform to the MII protocol assemble the phyAddr and regAddr bits in
  // the proper field locations. Also, set the busy bit and the bit indicating
  // a write operation.
  regval |= (((uint32_t)phyAddr << ETH_MACMIIAR_PA_SHIFT) & ETH_MACMIIAR_PA_MASK);
  regval |= (((uint32_t)regAddr << ETH_MACMIIAR_MR_SHIFT) & ETH_MACMIIAR_MR_MASK);
  regval |= (ETH_MACMIIAR_MB | ETH_MACMIIAR_MW);

  // Write the value to the data register
  putreg32((uint32_t)value, STM32_ETH_MACMIIDR);

  // Write the destination register address in the MACIIDR register
  putreg32(regval, STM32_ETH_MACMIIAR);

  // When the ETH_MACMIIAR_MW is clear, the write has completed.
  for (timeout = 0; timeout < LAN9355_PHY_WRITE_TIMEOUT; timeout++)
  {
    if ((getreg32(STM32_ETH_MACMIIAR) & ETH_MACMIIAR_MB) == 0)
    {
      return OK;
    }
  }

  syslog(1, "mon-MII Transfer timed out: phyAddr: %04x regAddr: %04x value: %04x\n",
        regAddr, phyAddr, value);

  return -ETIMEDOUT;
}

//=============================================================
// This is a special 32-bit write that is needed by the LAN9355 to access its
// Control and Status Registers (CSRs)
int meadow_eth_phywrite_32(uint16_t csrAddr, uint32_t value)
{
  int ret;
  uint8_t phyAddr;
  uint8_t regAddr;

  // Break the csrAddr down into it's component parts so it can ride on the
  // MII protocol. See LAN9355 data sheet section 14.2.
  // phyAddr is bit 4 set plus bits 9:6 of csrAddr as bits 3:0 of phyAddr.
  phyAddr = 0x10 | ((csrAddr >> 6) & 0x0f);

  // regAddr is bits 5:1 of csrAddr. Note: bit 0 of csrAddr is ignored.
  // However, bit 0 (which was csrAddr bit 1) determines if the upper or
  // lower 16-bits of the CSR register is being accessed
  regAddr = (csrAddr >> 1) & 0x1f;

  // Write the lower 16-bits
  ret = meadow_eth_phywrite_16(phyAddr, regAddr, value & 0xffff);
  if (ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-meadow_eth_phywrite_16-1 failed, ret:%d, errno:%d\n",
                thisFile, __LINE__, ret, errno);
    return ret;
  }

  // Write the upper 16-bits by setting regAddr bit 0 to 1 and writing the
  // upper 16-bits
  ret = meadow_eth_phywrite_16(phyAddr, regAddr + 1, value >> 16);
  if (ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-meadow_eth_phywrite_16-2 failed, ret:%d, errno:%d\n",
                thisFile, __LINE__, ret, errno);
    return ret;
  }

  return OK;
}

//=============================================================
// This is a special 32-bit read that is needed by the LAN9355 to access its
// Control and Status Registers (CSRs). See LAN9355 section 5.1.
int meadow_eth_phyread_32(uint16_t csrAddr, uint32_t *value)
{
  int ret;
  uint8_t phyAddr;
  uint8_t regAddr;
  uint16_t temp16;

  // Break the csrAddr down into it's component parts. See LAN9355 data sheet
  // section 14.2.
  // phyAddr is bit 4 set plus bits 9:6 of csrAddr.
  phyAddr = 0x10 | ((csrAddr >> 6) & 0x0f);

  // regAddr is bits 5:1 of csrAddr without. Note: bit 0 of csrAddr is ignored.
  // However, bit 0 (which was csrAddr bit 1) determines if the upper or
  // lower 16-bits of the CSR register is being accessed
  regAddr = (csrAddr >> 1) & 0x1f;

  // Read the lower 16-bits
  ret = meadow_eth_phyread_16(phyAddr, regAddr, &temp16);
  if (ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-meadow_eth_phyread_16-1 failed, ret:%d, errno:%d\n",
                thisFile, __LINE__, ret, errno);
    return ret;
  }

  // Lower 16-bits
  *value = temp16;

  // Now read the upper 16-bits by setting regAddr bit 0 to 1
  ret = meadow_eth_phyread_16(phyAddr, regAddr + 1, &temp16);
  if (ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-meadow_eth_phyread_16-2, ret:%d, errno:%d\n",
                thisFile, __LINE__, ret, errno);
    return ret;
  }

  // Add the upper 16-bits
  *value |= temp16 << 16;

  return OK;
}


#endif // #if defined(CONFIG_MEADOW_ETHNET_INCLUDE_IN_BUILD)
